app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY author ASC
SELECT "books".* FROM "books" ORDER BY sort_order DESC
---
  def index
   if(params[:s] != nil)
      session[:sort_mode] = params[:s]
    else
      session[:sort_mode] = "c"
    end

    if(session[:sort_mode] == "a")
      @books = Book.all.order("author ASC")
    else
      @books = Book.all.order("sort_order DESC")

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."sort_order" = ? ORDER BY "books"."id" ASC LIMIT ?  [["sort_order", 1], ["LIMIT", 1]]
UPDATE "books" SET "sort_order" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["sort_order", 1], ["updated_at", "2019-08-09 13:46:29.501126"], ["id", 1]]
UPDATE "books" SET "sort_order" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["sort_order", 1], ["updated_at", "2019-08-09 14:38:29.686182"], ["id", 2]]
---
  def move_up
    resort_orders
    @book = Book.find(params[:id])
    @above_book = Book.all.where(sort_order: @book.sort_order + 1).first

    if(@above_book != nil)
      new_order = @above_book.sort_order
      @above_book.sort_order = @book.sort_order
      @book.sort_order = new_order
      @above_book.save
      @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."sort_order" = ? ORDER BY "books"."id" ASC LIMIT ?  [["sort_order", 0], ["LIMIT", 1]]
UPDATE "books" SET "sort_order" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["sort_order", 0], ["updated_at", "2019-08-09 13:46:27.983780"], ["id", 1]]
UPDATE "books" SET "sort_order" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["sort_order", 0], ["updated_at", "2019-08-09 14:38:33.921825"], ["id", 2]]
---
  def move_down
    resort_orders
    @book = Book.find(params[:id])
    @above_book = Book.all.where(sort_order: @book.sort_order - 1).first

    if(@above_book != nil)
      new_order = @above_book.sort_order
      @above_book.sort_order = @book.sort_order
      @book.sort_order = new_order
      @above_book.save
      @book.save

INSERT INTO "books" ("title", "author", "publish_date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["author", ""], ["publish_date", "2019-08-21"], ["description", ""], ["created_at", "2019-08-15 14:12:46.871946"], ["updated_at", "2019-08-15 14:12:46.871946"]]
---
  def create
    @book = Book.new(book_params)
    resort_orders
    respond_to do |format|
      if @book.save

UPDATE "books" SET "cover_image" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["cover_image", "book_cover.jpeg"], ["updated_at", "2019-08-15 14:26:21.511457"], ["id", 1]]
---
  def update
    resort_orders
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" ORDER BY sort_order ASC
UPDATE "books" SET "sort_order" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["sort_order", 0], ["updated_at", "2019-08-09 13:41:37.986400"], ["id", 3]]
---
    def resort_orders
      @books = Book.all.order("sort_order ASC")
      i = 0
      @books.each do |book|
        book.sort_order = i
        book.save